common/widgets/LatestArticleWidget.php

    public function run()
    {
        $articles = Article::find()
            ->where(['is_del' => 0])
            ->orderBy(['id' => SORT_DESC])
            ->limit(static::ARTICLE_SIZE)
            ->all();
---
SELECT * FROM `article` WHERE `is_del`=0 ORDER BY `id` DESC LIMIT 3