common/widgets/TagCloudWidget.php

SELECT * FROM `tag` WHERE `usecount` > 0 ORDER BY `usecount` DESC, `id` DESC LIMIT 15
---
    public function run()
    {
        $tags = Tag::find()
            ->where(['>', 'usecount', 0])
            ->orderBy(['usecount' => SORT_DESC, 'id' => SORT_DESC])
            ->limit(static::MAX_SHOW_COUNT)
            ->asArray()
            ->all();