common/models/Article.php

    public function getTags(){
        return $this->hasMany(Tag::className(), ['id' => 'tag_id'])
            ->viaTable(TagIndex::tableName(), ['article_id' => 'id'])
            ->asArray()
            ->all();
---
SELECT * FROM `tag` WHERE 0=1
SELECT * FROM `tagindex` WHERE `article_id`='37'

    public function removeTags(){
        $articleId = $this->getAttribute('id');
        if(!$articleId){
            throw new InvalidParamException('文章ID参数不正确');
        }
        //删除与该篇文章相关联的标签
        TagIndex::deleteAll(['article_id' => $articleId]);
---
DELETE FROM `tagindex` WHERE `article_id`='42'

    public function updateTagCount($value = 1){
        $articleId = $this->getAttribute('id');
        if(!$articleId){
            throw new InvalidParamException('文章ID参数不正确');
        }

        //更新标签引用计数
        $tags = $this->getTags();
        $tagIds = ArrayHelper::getColumn($tags, 'id');
        $value = (int)$value;
        Tag::updateAllCounters(['usecount' => $value], ['in', 'id', $tagIds]);
---
UPDATE `tag` SET `usecount`=`usecount`+-1 WHERE 0=1

    public function add($data, $isUpdate = false){
        $trans_flag = true;
        $trans = self::getDb()->beginTransaction();    //开启事务

        if($isUpdate && !$this->thumbnail){
            unset($this->thumbnail);
        }

        if(!$this->save()){
            $trans_flag = false;
        }

        if($isUpdate){
            $this->removeTags();
            $this->updateTagCount(-1);
        }

        $tags = preg_replace('/ {2,}/', ' ', trim($data['inputTags']));    //多个连续空格替换成一个
        if($tags){
            $tags = explode(' ', $tags);
            $tags = array_unique(array_filter($tags));
            $tags = array_slice($tags, 0, 5);
            Tag::add($tags);
            $tagID = Tag::find()->select('id')->where(['tagname' => $tags])->asArray()->all();
---
UPDATE `article` SET `description`='    我喜欢程序员，他们单纯、固执、容易体会到成就感；面对压力，能够挑灯夜战不眠不休；面对困难，能够迎难而上挑战自我。他们也会感到困惑与傍徨，但每个程序员的心中都有一个比尔盖茨或是乔布斯的梦想“用智慧开创属于自己的事业”。我想说的是，其实我是一个程序员', `publish_time`='1468315189' WHERE `id`='42'
SELECT `id` FROM `tag` WHERE `tagname`='萌宠'

                $dataArray[] = [$articleId, $id];
            }
            $db = self::getDb();
            if(!$db->createCommand()->batchInsert('tagindex', ['article_id', 'tag_id'], $dataArray)->execute()){
---
INSERT INTO `tagindex` (`article_id`, `tag_id`) VALUES ('42', '49')