common/models/ArticleForm.php

SELECT * FROM `article_tag` WHERE `aid`='46'
SELECT * FROM `article_content` WHERE `aid`='46'
---
    public static function findOne($condition)
    {
        $model = new self();
        $article = Article::findOne($condition);
        if (NULL === $article)
        {
            return NULL;
        }

        $model->attributes = $article->attributes;

        //  标签
        $articleTags = ArticleTag::find()->where(['aid' => $article->id])
            ->asArray()->indexBy('id')->all();

        if (!$articleTags)
        {
            $model->tag = [];
        }
        else
        {
            $model->tag = implode(' ', ArrayHelper::getColumn($articleTags, 'tname', TRUE));
        }

        //  文章正文
        $articleContent = ArticleContent::findOne(['aid' => $article->id]);

SELECT * FROM `article_thumb` WHERE `aid`='46'
---
        }

        //  图集
        $articleThumbs = ArticleThumb::find()
            ->where(['aid' => $article->id])
            ->asArray()->indexBy('id')->all();