common/models/Article.php

    public function getTag(){
        return $this->hasMany(ArticleTag::className(), ['aid' => 'id'])->asArray()->all();
---
SELECT * FROM `article_tag` WHERE `aid`='50'