common/models/Tag.php

SELECT * FROM `article_tag` WHERE `tid`='30'
---
    public function getArticles(pagination $pagination = NULL){
        $articleTable = Article::tableName();
        if($pagination){
            return $this->hasMany(Article::className(), ['id' => 'aid'])
                ->via('articleTag')
                ->where(["{$articleTable}.is_del" => 0])
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
        }else{
            return $this->hasMany(Article::className(), ['id' => 'aid'])
                ->via('articleTag')
                ->where(["{$articleTable}.is_del" => 0])
                ->all();