common/models/Tag.php

    public static function add(array $tags){
        //查找所有已存在的tag标签，把引用数加1
        $tagARs = self::find()->where(['in', 'tagname', $tags])->indexBy('tagname')->all();
        foreach($tagARs as $tagAR){
            $tagAR->updateCounters(['usecount' => 1]);
        }
        $tags = array_diff($tags, array_keys($tagARs));
        //不存在的则新建
        foreach($tags as $tag){
            $tagObj = new self();
            $tagObj->tagname = $tag;
            $tagObj->usecount = 1;
            $tagObj->addtime = time();
            $tagObj->save();
---
INSERT INTO `tag` (`tagname`, `usecount`, `addtime`) VALUES ('萌宠', '1', '1468048953')