common/models/Tag.php

SELECT * FROM `article` WHERE (`is_del`=0) AND (`id` IN ('29', '32')) LIMIT 10
SELECT * FROM `article` WHERE (`article`.`is_del`=0) AND (`id` IN ('29', '32')) LIMIT 10
SELECT COUNT(*) FROM `article` WHERE (`is_del`=0) AND (`id` IN ('29', '32'))
---
    public function getArticles(pagination $pagination = NULL){
        if($pagination){
            return $this->hasMany(Article::className(), ['id' => 'article_id'])
                ->viaTable(TagIndex::tableName(), ['tag_id' => 'id'])
                ->where(['is_del' => 0])
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
        }else{
            return $this->hasMany(Article::className(), ['id' => 'article_id'])
                ->viaTable(TagIndex::tableName(), ['tag_id' => 'id'])
                ->where(['is_del' => 0])
                ->all();

SELECT COUNT(*) FROM `article` WHERE (`article`.`is_del`=0) AND (`id` IN ('29', '32'))
---
    public function getArticlesCount(){
        return $this->hasMany(Article::className(), ['id' => 'article_id'])
            ->viaTable(TagIndex::tableName(), ['tag_id' => 'id'])
            ->where(['is_del' => 0])
            ->count();

UPDATE `tag` SET `usecount`=`usecount`+1 WHERE `id`='49'
---
    public static function add(array $tags){
        //查找所有已存在的tag标签，把引用数加1
        $tagARs = self::find()->where(['in', 'name', $tags])->all();
        $existTags = [];
        foreach($tagARs as $tagAR){
            if (!$tagAR->updateCounters(['usecount' => 1]))