common/models/TextArticle.php

SELECT * FROM `article_content` WHERE `aid`='46'
---
    public function getContent()
    {
        $content = $this->hasOne(ArticleContent::className(), ['aid' => 'id'])
            ->one();