backend/modules/article/controllers/ArticleController.php

SELECT * FROM `article` WHERE (`id`=37) AND (`is_del`=0)
---
    public function actionView($id)
    {
        $id = (int)$id;
        if(!$id){
            return $this->error('ID参数错误');
        }
        $article = Article::findOne(['id' => $id, 'is_del' => 0]);

SELECT * FROM `article` WHERE (`id`=46) AND (`is_del`=0)
---
    public function actionUpdate($id)
    {

        $id = intval($id);
        if(!$id){
            return $this->error('ID参数错误');
        }

        $article = Article::findOne(['id' => $id, 'is_del' => 0]);