backend/modules/article/controllers/ArticleRecycleController.php

    public function actionIndex()
    {
        $pagination = new Pagination([
            'defaultPageSize' => self::RECYCLE_PAGESIZE,
            'totalCount' => Article::find()->where(['is_del' => 1])->count()
        ]);

        $articles = Article::find()
            ->where(['is_del' => 1])
            ->orderBy(['del_time' => SORT_DESC, 'id' => SORT_DESC])
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `article` WHERE `is_del`=1
SELECT * FROM `article` WHERE `is_del`=1 ORDER BY `del_time` DESC, `id` DESC LIMIT 10