backend/modules/article/controllers/TagController.php

SELECT * FROM `tag` WHERE `id`=30
---
    public function actionView(){
        $id = (int)Yii::$app->request->get('id');
        if(!$id){
            $this->error('标签ID参数错误');
        }

        $tag = Tag::findOne($id);